if ( ! YMaps ) { 
 console.log( 'YMaps is not goimg' );
} else {
 var country = YMaps.location.country;
 console.log( 'Ты сейчас в стране под названием ' + country );	
};



var arrayofcountries = [
 "Австрия", "Албания", "Андорра", "Белоруссия", "Бельгия", "Болгария",
 "Босния", "Герцеговина", "Ватикан", "Великобритания", "Венгрия",
 "Германия", "Греция", "Дания", "Ирландия", "Исландия",
 "Испания", "Италия", "Латвия", "Литва", "Лихтенштейн",
 "Люксембург", "Македония", "Мальта", "Молдавия", "Монако",
 "Нидерланды", "Норвегия", "Польша", "Португалия",
 "Россия", "Румыния", "Сан-Марино", "Сербия" , "Словакия",
 "Словения", "Украина", "Финляндия", "Франция", "Хорватия",
 "Черногория", "Чехия", "Швейцария", "Швеция", "Эстония"
];

console.log( arrayofcountries.indexOf(country) );
 
